class Area < ActiveHash::Base
  self.data = [
    { id: 1, name: '--' },
    { id: 2, name: '池袋・目白' },
    { id: 3, name: '赤羽・板橋・王子・巣鴨' },
    { id: 4, name: '上野・神田・北千住・亀有' },
    { id: 5, name: '両国・錦糸町・小岩・森下・瑞江' },
    { id: 6, name: '門前仲町・勝どき・月島・豊洲' },
    { id: 7, name: '銀座・有楽町・新橋・丸の内・日本橋' },
    { id: 8, name: '御茶ノ水・四ツ谷・千駄木' },
    { id: 9, name: '新宿・高田馬場・代々木' },
    { id: 10, name: '渋谷' },
    { id: 11, name: '青山・表参道・原宿' },
    { id: 12, name: '代官山・中目黒・自由が丘・武蔵小杉' },
    { id: 13, name: '恵比寿・広尾・六本木・麻布・赤坂' },
    { id: 14, name: '品川・五反田・目黒' },
    { id: 15, name: 'その他' }
  ]
end